{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"tick","class_name":"InputLayer","config":{"batch_input_shape":[1,1,134],"dtype":"float32","sparse":false,"name":"tick"},"inbound_nodes":[]},{"name":"board","class_name":"InputLayer","config":{"batch_input_shape":[1,1,280],"dtype":"float32","sparse":false,"name":"board"},"inbound_nodes":[]},{"name":"skipTick","class_name":"InputLayer","config":{"batch_input_shape":[1,1,1],"dtype":"float32","sparse":false,"name":"skipTick"},"inbound_nodes":[]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["tick",0,0,{}],["board",0,0,{}],["skipTick",0,0,{}]]]},{"name":"theBrain","class_name":"SimpleRNN","config":{"units":35,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"UnitNorm","config":{"axis":0}},"recurrent_constraint":{"class_name":"UnitNorm","config":{"axis":0}},"bias_constraint":{"class_name":"UnitNorm","config":{"axis":0}},"dropout":0.10000000149011612,"recurrent_dropout":0,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":true,"unroll":false,"name":"theBrain","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"weighChoices","class_name":"Dense","config":{"units":40,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"weighChoices","trainable":true},"inbound_nodes":[[["theBrain",0,0,{}]]]},{"name":"moveChooser","class_name":"Softmax","config":{"axis":-1,"name":"moveChooser","trainable":true},"inbound_nodes":[[["weighChoices",0,0,{}]]]}],"input_layers":[["tick",0,0],["board",0,0],["skipTick",0,0]],"output_layers":[["moveChooser",0,0]]},"keras_version":"tfjs-layers 1.1.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"theBrain/kernel","shape":[415,35],"dtype":"float32"},{"name":"theBrain/recurrent_kernel","shape":[35,35],"dtype":"float32"},{"name":"theBrain/bias","shape":[35],"dtype":"float32"},{"name":"weighChoices/kernel","shape":[35,40],"dtype":"float32"},{"name":"weighChoices/bias","shape":[40],"dtype":"float32"}]}]}